# Resolution Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConnectionValidationWarning..::..Resolution Property
ConnectionValidationWarning Class See Also
---
Enumeration for resolution that was applied.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public ConnectionResolution Resolution { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Resolution As ConnectionResolution
	Get
```

Visual C++
---
```text
public:
property ConnectionResolution Resolution {
	ConnectionResolution get ();
}
```

# See Also
ConnectionValidationWarning Class
Autodesk.Revit.DB Namespace